[
  {
    "chunk_id": "doc_0000",
    "text": "KiloCode – Full System Documentation\nThis document provides a consolidated overview of how KiloCode works, including architecture,\nworkflows, modes, error handling, configuration, and best practices.\n\n1. System Overview\nKiloCode is an autonomous AI coding agent designed to operate inside development environments\n(such as VS Code). It uses a task-oriented agent architecture combined with modes, tools,\nmemory, and rules to safely and efficiently perform software development tasks.\n\nCore components:\n1\nLLM Provider Layer – Connects to OpenRouter, OpenAI-compatible APIs, or local models.\n2\nAgent Modes – Predefined behavior profiles (Code, Debug, Architect, Ask).\n3\nTooling Layer – File system access, terminal execution, browser, memory.\n4\n\nRules Engine – Enforces constraints and project standards.\n5\n\nMemory Bank – Persistent long-term context.\n\n2. Agent Modes\n1\n\nCode Mode – Writes, edits, and refactors code.\n2\nDebug Mode – Diagnoses errors, stack traces, and runtime issues.\n3\nArchitect Mode – Designs systems and proposes technical plans.\n4\n\nAsk Mode – Answers conceptual or technical questions."
  },
  {
    "chunk_id": "doc_0001",
    "text": "traces, and runtime issues.\n3\nArchitect Mode – Designs systems and proposes technical plans.\n4\n\nAsk Mode – Answers conceptual or technical questions.\n\n3. Workflows\nWorkflows are markdown-based scripts stored in .kilocode/workflows/. They allow deterministic\nstep-by-step execution of complex tasks such as code generation, audits, or migrations.\n\n4. Skills\nSkills are reusable instruction blocks stored in .kilocode/skills/. They extend the agent’s abilities and\ncan be global or project-specific.\n\n5. CLI Usage\n1\nkilocode run – Executes the agent.\n2\nkilocode doctor – Diagnostics and environment checks.\n3\nkilocode update – Updates the agent.\n\nCLI Exit Codes:\n1\n0 – Success\n2\n1 – General error\n\n3\n124 – Timeout\n\n6. Error Handling\nKiloCode handles errors through layered validation, tool fallbacks, and retry logic. Most errors fall\ninto configuration, provider, or tool execution categories.\n1\nProvider errors – Invalid API keys, rate limits, or model incompatibility.\n2\nTool errors – Terminal failures, permission issues, or missing files.\n3\nContext errors – Overloaded context window or malformed workflows.\n\n7. Rules & Compliance\nRules define strict behavioral constraints and are enforced before output generation. They can\ncontrol code style, security, compliance, and language usage."
  },
  {
    "chunk_id": "doc_0002",
    "text": "define strict behavioral constraints and are enforced before output generation. They can\ncontrol code style, security, compliance, and language usage.\n\n8. Memory Bank\nThe Memory Bank stores long-term project context and decisions. This improves continuity and\nreduces repetition across sessions.\n\n9. MCP (Model Context Protocol)\nMCP allows KiloCode to interact with external services and internal tools using a standardized\ninterface.\n\n10. Best Practices\n1\n\nUse Architect mode before large changes.\n2\n\nDefine rules early for consistency.\n3\n\nUse workflows for repeatable tasks.\n4\nMonitor CLI exit codes during automation."
  }
]